20221111125428-newrizon_proposals_for_chiplego.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Newrizon Proposals for ChipLego</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Newrizon Proposals for ChipLego</h1>
<p>
:ID:       bcbf0874-b795-4fa7-ba8c-8d59ebc66f30
</p>

<ul class="org-ul">
<li><a id="org7bad5b0"></a>Requirements<br />
<ul class="org-ul">
<li><a id="org791e264"></a>3d is important<br /></li>
<li><a id="org47220a1"></a>big model is relevant to performance<br /></li>
<li><a id="org824db69"></a>occlusions need to be handled<br /></li>
</ul>
</li>
<li><a id="orga475841"></a>Basic modules<br />
<ul class="org-ul">
<li><a id="org2709c9f"></a>transformer<br /></li>
<li><a id="orga270fd6"></a>convolution<br />
<ul class="org-ul">
<li><a id="orgc1e3d15"></a>UNet<br /></li>
</ul>
</li>
<li><a id="org7054c13"></a>MLP<br /></li>
<li><a id="orgba651c1"></a>encoder, decoder (VAE)<br /></li>
<li><a id="org60b9286"></a>generative model (diffusion)<br /></li>
</ul>
</li>
<li><a id="orgc20537f"></a>Proposals<br />
<ul class="org-ul">
<li><a id="org838db17"></a>Model zoo TIMM with pretrained model and various model size<br />
<ul class="org-ul">
<li><a id="orgd7f087d"></a>different types of computer, big &#x2013;&gt; small<br /></li>
<li><a id="org2a2181d"></a>Vision model as encoder<br />
<ul class="org-ul">
<li><a id="org9169124"></a>ViT-pytorch (lucidrain)<br /></li>
<li><a id="orga3c417b"></a>RegNet<br /></li>
<li><a id="orgd16ff14"></a>ConvNext<br /></li>
<li><a id="org4deff88"></a>FocalNet<br /></li>
</ul>
</li>
</ul>
</li>
<li><a id="orgf74c8d3"></a>Steps:<br />
<ul class="org-ul">
<li><a id="org4f664ac"></a>evaluate accessible models<br /></li>
<li><a id="orgdf13938"></a>add layers and scale up inputs to test<br /></li>
<li><a id="orga398f3e"></a>adapt big models to HW (see. AlexNet)<br /></li>
</ul>
</li>
<li><a id="orga4cb692"></a>"All in One" structure: Generative models (Stable Diffusion model)<br /></li>
</ul>
</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
